[
    
    {
        "front": "SAP Gateway service test environment in the FES",
        "back": "SAP Gateway Client(/IWFND/GW_CLIENT)"
    },
    {
        "front": "Central SAP Gateway development environment in the BES",
        "back": "Sap Gateway Service Builder (SEGW)"
    },
    {
        "front": "Central ABAP development environment in the BES",
        "back": "ABAP Workbench(SE80)"
    },
    {
        "front": "Services provided by SAP HANA Platform",
        "back": "Application, Processing, Integration, Database"
    },
    {
        "front": "Provides tools for administration and monitoring of SAP HANA db  resources and for development capabilities through the SAP HANA explorer. Can be used to start and stop services, to monitor the system, to configure system settings and to manage users and authorizations",
        "back": "SAP HANA Cockpit"
    },
    {
        "front": "In most cases SAP recommends the _____ deployment for SAP S/4HANA",
        "back": "embedded"
    },
    {
        "front": "____ views are the basis for all analytical applications in S4H, abled to integrate with SAP S/4HANA embedded analytics, which originated from SAP Business Warehouse",
        "back": "ABAP CDS(Core Data Services)"
    },
    {
        "front": "There is no need to access data views via SAP HANA XS in the SAP BSP when using ___",
        "back": "ABAP CDS Views"
    },
    {
        "front": "Core element of SAP Smart business is the ___",
        "back": "KPI"
    },
    {
        "front": "is built on top of ABAP CDS Views and define evaluations, tiles and drilldowns",
        "back": "KPI"
    },
    {
        "front": "___ is in place as next generation of central app in SAP Smart Business",
        "back": "Manage KPIs and Reports[f2814]"
    },
    {
        "front": "since SAP S/4HANA 1511 the ____ is the central app for managing KPIs",
        "back": "KPI Workspace[F0818]"
    },
    {
        "front": "app can be started to actually deffine a query handling dimesnion, tables and charts, the result can be saved as a tile to access the query directly in the SAP FLP",
        "back": "Custom Analytical Queries[F1572]"
    },
    {
        "front": "SAP Enterprise Search, successor to SAP Netweaver enterprise search uses Protocol used for direct network communication, parrelels to OData but specialized for search requests and responses",
        "back": "SAP Proprietary Information Access(inA) protocol"
    },
    {
        "front": "SAP Gateway search service, if reggistered all search request for SAP Fiori search are routed through this service.",
        "back": "ESH_SEARCH_SRV"
    },
    {
        "front": "Important transactions that work both on SAP Search and Classfication(TREX, used by SAP Netweaver enterprise search) and SAP HANA enterprise search",
        "back": "ESH_COCKPIT, ESH_MODELER, ESH_TEST_SEARCH, ESH_IMG"
    },
    {
        "front": "for connectors of search models to the search engine",
        "back": "Connector Administration Cockpit(ESH_COCKPIT)"
    },
    {
        "front": "Modeler for search and analytic for managing search object connector models",
        "back": "Search and Analytics Modeler (ESH_MODELER)"
    },
    {
        "front": "Test environment for enterprise search, checking consistency of connectors and search results",
        "back": "Enterprise Search Test(ESH_TEST_SEARCH)"
    },
    {
        "front": "Area of the implementation guide containing administration and configuration of enterprise search",
        "back": "Search and Operational Analytics Implementation Guide(ESH_IMG)"
    },
    {
        "front": "Removing unwanted search objects/duplicates",
        "back": "For both classic search objects and CDS View-based search objects, you can deactivate the matching search connector in transaction ESH_COCKPIT, For CDS View searches only, you can deactivate the matching search connector in SAP Fiori app F3036 Manage Search Models,  ESH_DASHBOARD."
    },
    {
        "front": "If you encounter a duplicate search connector what might be the cause?",
        "back": "where you see “duplicate” searches it’s usually where a new CDS View search model has been introduced to replace the older classic search option."
    },
    {
        "front": "When using ABAP CDS Views, there is no need to access search connectors directly via InA such as in the SAP Business Suite.",
        "back": "true"
    },
    {
        "front": "Users of the SAP Fiori launchpad may activate a personalized search in the FLP settings under _______. After activation, all search requests of the user in the SAP Fiori search are logged and made available via the _____.",
        "back": "User Profiling, My Queries [F3719] app"
    },
    {
        "front": "These defaults for collecting user-specific data can be managed via _____.",
        "back": "the Configure Personalized Search [F2800] app."
    },
    {
        "front": "deployed as stored procedures in SAP HANA",
        "back": "ABAP Managed Database Procedures"
    },
    {
        "front": "ABAP CDS Views on Hana",
        "back": "SAP HANA Views"
    },
    {
        "front": "CDS Views are developed using",
        "back": "ABAP Development Tools (ADT) in Eclipse"
    },
    {
        "front": "CDS Views are stored in ____, and can only be viewed using ______ in the SAP GUI",
        "back": "ABAP repository, transaction SE80"
    },
    {
        "front": "AMDPs are developed using ____, and can only be viewed using ____ in SAP GUI.",
        "back": "Eclipse ADT, transaction SE80"
    },
    {
        "front": "a global class method containing SQLScript as the programming language.",
        "back": "AMDP"
    },
    {
        "front": "The set of SQL extensions for the SAP HANA db that allow developers to push data intensive logic into the database is called _____",
        "back": "SQLScript"
    },
    {
        "front": "AMDPs can be identified by the syntax __ behind the method name",
        "back": "BY DATABASE PROCEDURE FOR HDB LANGUAGE SQLSCRIPT"
    },
    {
        "front": "Classes containing AMDPs implement the marker interface ____",
        "back": "IF_AMDP_MARKER_HDB"
    },
    {
        "front": "in the SAPUI5 development environment you can enrich the UI definition by adding annotations in the _____ or by _____",
        "back": "annotation.xml, mapping page config files"
    },
    {
        "front": "The ____ as part of SAP BAS are recommended tool for developing SAP Fiori elements artificats on UI-Level",
        "back": "SAP Fiori tools"
    },
    {
        "front": "Which system holds the SAP Fiori Launch pad in hub deployment",
        "back": "The FES"
    },
    {
        "front": "Which system component is split between front-end server and back-end server?",
        "back": "SAP Gateway"
    },
    {
        "front": "Which ABAP repository element contains the service logic?",
        "back": "DPC(Data Provider Class)"
    },
    {
        "front": "How is the implementation of SAP Fiori apps delivered by SAP?",
        "back": "Updates of the back-end server"
    },
    {
        "front": "Which data processing capabilities does SAP HANA combine?",
        "back": "Analytical and transactional"
    },
    {
        "front": "Which system part provides the analytical data in SAP S/4HANA?",
        "back": "SAP S/4HANA Embedded Analytics"
    },
    {
        "front": "What is the data source defintion for the SAP Fiori search?",
        "back": "Search connectors"
    },
    {
        "front": "What is the data source definition for object pages?",
        "back": "ABAP CDS View"
    },
    {
        "front": "What is used in S/4HANA to read data from databases?",
        "back": "ABAP CDS"
    },
    {
        "front": "What is used in SAP S/4HANA to run native code on the database?",
        "back": "AMPD ABAP Managed Database Procedures"
    },
    {
        "front": "_____ catalogs define apps per solution area",
        "back": "Technical"
    },
    {
        "front": "_____ catalogs reference these apps per duty of the user.",
        "back": "Business"
    },
    {
        "front": "_____ can only be defined in configuration",
        "back": "Technical"
    },
    {
        "front": "____ catalogs can be defined in configuration and customizing",
        "back": "business"
    },
    {
        "front": "_____ can be defined for configuration(cross-client), customizing(client-specific) and personailzation(user)",
        "back": "groups"
    },
    {
        "front": "____ and ____ are defined in customizing and ar changable in personalization",
        "back": "spaces, pages"
    },
    {
        "front": "______ roles are assigned to users in customizing",
        "back": ""
    },
    {
        "front": "Can handle configuration and customizing of groups, technical and business catalogs alike",
        "back": "SAP Fiori launchpad designer"
    },
    {
        "front": "ABAP Transaction for roles available for decades",
        "back": "PFCG"
    },
    {
        "front": "ABAP transaction for business catalogs avialable since SAP_UI 7.53",
        "back": "FLPCM"
    },
    {
        "front": "ABAP Transaction for technical catalogs available since SAP_UI 7.55",
        "back": "FLPAM"
    },
    {
        "front": "App for spaces available since SAP_UI 7.55",
        "back": "Manage Launchpad Spaces"
    },
    {
        "front": "SAP Fiori launchpad app for pages availalble since SAP_UI 7.55",
        "back": "Manage Launchpad Pages"
    },
    {
        "front": "Since SAP_UI 7.55 the ______ role includes all tools for maintianing SAP Fiori.",
        "back": "SAP_FLP_ADMIN"
    },
    {
        "front": "The core two catalogs for maintaining SAP Fiori with SAP_FLP_ADMIN role",
        "back": "SAP_BASIS_BC_UI_FLA, SAP_BASIS_BC_UI_FLD"
    },
    {
        "front": "single role that replaces the SAP_UI2_ADMIN composit role",
        "back": "SAP_FLP_ADMIN"
    },
    {
        "front": "Catalogs, groups and spaces can be added to user roles using",
        "back": "The role maintenance transaction PFCG"
    },
    {
        "front": "If a newly created element is not available in the PFCG dialog box",
        "back": "restart the PFCG"
    },
    {
        "front": "sort the order of spaces in the FLP",
        "back": "via technical keys"
    },
    {
        "front": "When creating or changing a space, a custimizing ___ is mandatory",
        "back": "transport request"
    },
    {
        "front": "Every space has",
        "back": "ID(Customer space IDs must start with Z or Y and should contain abbreviation SP), description, title and at least one page"
    },
    {
        "front": "Every page has",
        "back": "ID(Customer space IDs must start with Z or Y and should contain abbreviation PG), description, title and at least one section"
    },
    {
        "front": "Sections are an integral part of pages and cannot",
        "back": "be reused in other pages"
    },
    {
        "front": "Sections group tiles by the _____",
        "back": "the level of dtails of a business task"
    },
    {
        "front": "It is also possible to select business catalogs manually in Manage Launchpad Pages. Hidden behind the ... button, all business catalogs can be selected as sources for tiles for the page. Tiles added in this way ___ ",
        "back": "will show the warning Out of role context and will not be displayed in the preview."
    },
    {
        "front": "The prerequisite for the user to see the tile in the FLP is that the corresponding business catalog is also part of the user master record. In other words",
        "back": "the source catalog of the tile must be assigned to any role also assigned to the user."
    },
    {

        "front": "______ known as standard catalogs provide app descriptors consisting of tiles and target mappings for web applications like SAPUI5",
        "back": "Technical Catalogs"
    },
    {
        "front": "Technical catalogs known as ______ or ______ provide app descriptors for classic applications like ABAP transactions originate from back-end servers.",
        "back": "replicable, backend catalogs"
    },
    {
        "front": "reference tiles and target mappings of Technical catalogs and Back end catalogs according to segregation of duty.",
        "back": "Business catalogs"
    },
    {
        "front": "Contain apps from various business catalogs making a subtopic",
        "back": "Business catalog groups"
    },
    {
        "front": "Combine multiple business catalogs and business catalog groups in one topic",
        "back": "Business roles"
    },
    {
        "front": "combine multiple pages into one topic",
        "back": "spaces"
    },
    {
        "front": "in sap business suite, replaces technical catalog roles and business catalog roles",
        "back": "Business roles"
    },
    {
        "front": "duty",
        "back": "business catalog"
    },
    {
        "front": "topic",
        "back": "business catalog group"
    },
    {
        "front": "end users role",
        "back": "Busniess role"
    },
    {
        "front": "introduced to ease mass-administration of catalogs",
        "back": "SAP Fiori Launchpad Content Manager (FLPCM)"
    },
    {
        "front": "can create/copy/check/transport catalog, reference tile and reference target mapping",
        "back": "FLPCM"
    },
    {
        "front": "can create/copy catalog, create group, create/reference tile, create/reference target mapping",
        "back": "FLPD"
    },
    {
        "front": "Tile: consist of title and subtitle, an icon, keywords for search and general information",
        "back": "App Launcher Static"
    },
    {
        "front": "Tile: can show dynamic number, number originates from odata service request, refresh interval can be set",
        "back": "App Launcher Dynamic"
    },
    {
        "front": "Tile: puprose show info from RSS(Really Simple Syndication) feeds, twice as large as other tiles, shows preview of feeds listed in tile definition, when selected shows all underlying elements of rss feeds",
        "back": "News tile"
    },
    {
        "front": "an intent consist of",
        "back": "semantic object, action"
    },
    {
        "front": "Which intent is called depends on",
        "back": "user role, same intent can lead to different results for different roles"
    },
    {
        "front": "contains information about what app to start, with what parameters and on what device types",
        "back": "Target mapping"
    },
    {
        "front": "represents a business entity such as a customer, a sales order, or a product",
        "back": "Semantic object"
    },
    {
        "front": "The central file of an SAP Fiori app based on SAPUI5 is",
        "back": "Component.js"
    },
    {
        "front": "To start an app(SAPUI5) the path to Component.js must be visible in statement",
        "back": "JQuery.sap.declare"
    },
    {
        "front": "In an embedded deployment all application types are allowed in ______ catalogs",
        "back": "technical"
    },
    {
        "front": "catalog type in central hub deployment, consist of SAPUI5 fiori apps, URL apps and tiles without target mapping in the frontend server",
        "back": "standard"
    },
    {
        "front": "catalogs that Consist of Web Dynpro ABAP apps, Webclient UI apps, and ABAP Transactions",
        "back": "Back end Catalogs in BES"
    },
    {
        "front": " Transaction ____ used in the FES to replicate back-end catalogs from BES as remote catalogs to the FES",
        "back": "/UI2/APPDESC_GET"
    },
    {
        "front": "For an ____ deployment, standard catalog is recommended as only catalog type",
        "back": "embedded"
    },
    {
        "front": "Mandatory fields app descriptor",
        "back": "semantic object, action, app type,one or more additional fields depending on app type"
    },
    {
        "front": "Tool for maintaining technical catalogs, offers list of technical catalogs and opens the FLPAM for the content of a single catalog, can create/delete and change catalog tiles",
        "back": "SAP Fiori Catalog Maintenance(/UI2/FLPCAT)"
    },
    {
        "front": "Is a kind of extraction of the app descriptors as tiles and target mappings in a remote catalog.",
        "back": "replication"
    },
    {
        "front": "A system alias for classic applications must be assigned to the back end cata log for replication to work",
        "back": "true"
    },
    {
        "front": "Transaction to view System aliases for maintenance",
        "back": "/UI2/V_SYSALIAS"
    },
    {
        "front": "For each classica application an _____ and ____ destionation should be created in ___",
        "back": "RFC(alias_RFC), HTTPS(alias_HTTPS), SM59"
    },
    {
        "front": "Used to map aliases to target system aliases",
        "back": "/UI2/V_ALIASMAP"
    },
    {
        "front": "Transaction to define system aliases for customers",
        "back": "/UI2/VC_SYSALIAS"
    },
    {
        "front": "System alias assignments for back-end catalogs derived by SAP can be found in maintenance view _____ , where also customers can assign system aliases to their back-end catalogs",
        "back": "/UI2/V_ALIASCAT"
    },
    {
        "front": "Transaction: Replicates all back-end and replicable catalogs referenced in selected business catalogs.",
        "back": "/UI2/APPDESC_GET"
    },
    {
        "front": "Replicates all back-end and replicable catalogs for all system aliases",
        "back": "/UI2/APPDESC_GET_ALL"
    },
    {
        "front": "Replicates selected back-end and replicable catalogs for selected system alias",
        "back": "/UI2/APPDESC_GET_DEV"
    },
    {
        "front": "How many spaces should be assigned to a business role according to best practices",
        "back": "one"
    },
    {
        "front": "Which tool provides the definition of SAP Fiori groups?",
        "back": "SAP FLPD"
    },
    {
        "front": "What is the prerequisite for a user to see the tiles of a group?",
        "back": "The catalogs containing the tile definitons are part of the user master record"
    },
    {
        "front": "Which element groups SAP Fiori apps based on solution area?",
        "back": "Technical Catalog"
    },
    {
        "front": "Which element groups SAP Fiori apps based on business duty?",
        "back": "Business Catalog"
    },
    {
        "front": "What is used to maintain technical catalogs?",
        "back": "SAP FLP application manager"
    },
    {
        "front": "What is meant by the term app descriptor?",
        "back": "Combination of tiles and target mappings in standard, replicable and back-end catalogs"
    },
    {
        "front": "Which catalog type must be set to enable back-end catalog maintenance in SAP Fiori Launchpad application manager?",
        "back": "None"
    },
    {
        "front": "What needs to be assigned to back-end catalogs for the replication to a front-end server?",
        "back": "System alias for classic applications"
    },
    {
        "front": "Transaction ____ offers many task list for a wide variation of technical configuration task in an ABAP system.",
        "back": "STC01"
    },
    {
        "front": "Task-list runs are logged in transaction ____",
        "back": "STC02"
    },
    {
        "front": "Technical setup for SAP Gateway, SAPUI5, and SAP Fiori Launchpad in one client, makes it posible to start SAP FLP",
        "back": "SAP_GW_FIORI_ERP_ONE_CLNT_SETUP"
    },
    {
        "front": "Initial setup for SAP FLP and SAP Fiori apps in SAP S/4HANA, makes it possible to use all features of SAP Fiori",
        "back": "SAP_FIORI_FOUNDATION_S4"
    },
    {
        "front": "Content activation for business roles shipped by SAP, makes it possible to use SAP Fiori apps defined in the business role",
        "back": "SAP_FIORI_CONTENT_ACTIVATION"
    },
    {
        "front": "Activates the content of business roles created by customers",
        "back": "SAP_FIORI_FCM_CONTENT_ACTIVATION"
    },
    {
        "front": "Define customer settings for FLP",
        "back": "/UI2/FLP_CUS_CONF"
    },
    {
        "front": "The semantic object for the FLP",
        "back": "Shell"
    },
    {
        "front": "What is the starting point for activating apps with rapid activation for SAP Fiori?",
        "back": "Business roles"
    },
    {
        "front": "What is the foundation role shipped by SAP for SAP Fiori users",
        "back": "SAP_FLP_USERS"
    },
    {
        "front": "What is missing in the foundation roles?",
        "back": "Authorizations"
    },
    {
        "front": "What needs to be created to enable FLP customizing per role?",
        "back": "A business catalog with a target mapping holding the customizing"
    },
    {
        "front": "What is the name space for SAP Gateway front-end transactions?",
        "back": "/IWFND/"
    },
    {
        "front": "_____ manages the themes in the theme repository of an SAP NetWeaver Application Server ABAP. Themes can be viewed, imported, exported, and deleted, as well as transported to the follow-up system. This is also the easiest way to get a URI pointing to a certain theme. Start the tool using the following transaction: _______",
        "back": "The Theme Tool,/UI5/ THEME_TOOL."
    },
    {
        "front": "By adding the URI parameter ______, which points to the theme repository, to the application URI, the theme is used as the design for the application. This is available to all clients but stays visible in the URI.",
        "back": "sap-theme=<theme-id>@<theme-root>"
    },
    {
        "front": "Central them parameter setting transaction SAP Enterprise portal and AS ABAP",
        "back": "/UI2/NWBC_CFG_CUST per client, /UI2/NWBC_CFG_SAP client independent"
    },
    {
        "front": "Since SAP S/4HANA 2020, the parameter _______ is available to set the theme in ________. In addition the parameter _____ hides all themes provided by SAP only showing customer-specific ones in the FLP-settings.",
        "back": "THEMING_DEFAULT_THEME,/UI2/FLP_CUS_CONF, THEMING_HIDE_SAP_THEMES"
    },
    {
        "front": "The ABAP Development Tools (ADT) define a project for connecting to the repository of an ABAP system. A CDS view is saved as part of a data definition in the ABAP repository. To extend a CDS view, a CDS view extension must be created in the customer namespace referencing the original CDS view.",
        "back": "true"
    },
    {
        "front": " the CDS View extension refers to the original CDS view using the syntax __________.",
        "back": "extend view <view_name> with <extension>"
    },
    {
        "front": "new sap bas based: ________ is a WYSIWYG editor to preview the application, make changes to the properties of controls, add code fragments, extend with controller, and see a list of changes that had been made.",
        "back": "The SAPUI5 Visual Editor"
    },
    {
        "front": "Plugins have the following characteristics:",
        "back": "Loaded automatically when FLP starts, implemented as a SAPUI5 component, implemented in a platform-independent way, Configured client-wide or assigned to roles"
    },
    {
        "front": "Developing a plugin involves the following steps",
        "back": "Implementing the plugin, Activating and configuring the plugin"
    },
    {
        "front": "_____ for BTP offers an extension called SAP Fiori Launchpad Plugin, main component of this extension is a template to create an SAP Fiori Launchpad Plugin",
        "back": "SAP Web IDE Full-Stack"
    },
    {
        "front": "Generally, there are no views in a plugin. All changes to the FLP are defined by accessing ______",
        "back": "the renderer of the FLP in the Component.js file."
    },
    {
        "front": "Every plugin must be defined in transaction ______ before it can be used in the FLP. The plugin needs an _________ similar to other SAPUI5 applications.",
        "back": "/UI2/FLP_CONF_DEF,FLP Plugin ID as well as the component ID and URL (ICF path)"
    },
    {
        "front": "Which system environments offer the UI Theme designer?",
        "back": "SAP Enterprise Portal, SAP Netweaver Application Server ABAP, SAP BTP"
    },
    {
        "front": "Which design template is used for SAP Fiori 3",
        "back": "SAP Quartz"
    },
    {
        "front": "Where are themes saved for the SAP Fiori launchpad?",
        "back": "Theme repository in front-end server"
    },
    {
        "front": "How do you enter the UI Adaptation mode of SAP Fiori apps?",
        "back": "Start app-> User Action Menu-> Adapt UI"
    },
    {
        "front": "which tool must be used to extend CDS Views?",
        "back": "ADT for Eclipse"
    },
    {
        "front": "What is used to extend the SAP Fiori launchpad?",
        "back": "SAPUI5 plugins"
    },
    {
        "front": "How can you activate an extension for SAP Fiori launchpad?",
        "back": "Customer Settings(/UI2/FLP_CUS_CONF), Target Mapping(/UI2/FLPD_CUST)"
    },
    {
        "front": "Two types of crossplatform development approaches mobile development",
        "back": "SAP Mobile Cards - scriptbased development for card UIs, MDK - metadata-based application development platform"
    },
    {
        "front": "______ is a feature within SAP Mobile Services. It provides customers access to a micro app platform to publish data into a consumer grade “wallet” or “passbook” style app. Using ________, companies can create simple, yet highly valuable quick-win apps.",
        "back": "SAP Mobile Cards"
    },
    {
        "front": "The SAP Mobile Cards app is available for",
        "back": "iOS, android"
    },
    {
        "front": "The generic client for running MDK apps on Apple iOS and Google Android is the _________ ",
        "back": " SAP Mobile Services Client."
    },
    {
        "front": "he SAP Mobile Services for SAP Business Technology Platform (BTP) serves as a middleware to enhance communication for mobile applications and provide additional features in apps. Such a middleware is called a",
        "back": "Mobile Application Development Platform (MADP)"
    },
    {
        "front": "The _____ was the on-premise solution of SAP for a Mobile Application Development Platform (MADP) and the precursor of the SAP Mobile Services. The ____ is no longer available and maintenance ended in 2020.",
        "back": "SAP Mobile Platform (SMP)"
    },
    {
        "front": "MDK web apps are deployed as HTML5-apps in the SAP BTP and can be accessed in web browsers",
        "back": "true"
    },
    {
        "front": "What can be used as middleware to improve SAP Fiori for mobile",
        "back": "SAP Mobile Services"
    },
    {
        "front": "What are the SAP Fiori for iOS guidelines based on?",
        "back": "HIG Apple Human Interface Guidelines"
    },
    {
        "front": "What is SAP BRP SDK assistant for iOS",
        "back": "Plugin for Apple Xcode to create ready-to-run Xcode projects for SAP Fiori"
    },
    {
        "front": "SAP BTP provides following environments:",
        "back": "Cloud Foundry, Kyma, ABAP, New environment"
    },
    {
        "front": "environment is a fully managed Kubernetes runtime based on the open-source project ___ that allows developers to extend SAP solutions with serverless functions and combine them with containerized microservices.",
        "back": "Kyma"
    },
    {
        "front": "What is SAP BTP",
        "back": "SAPS PaaS providing in-memory database and application services"
    },
    {
        "front": "What establishes a secure connection between on-premise systems and SAP BTP?",
        "back": "Cloud Connector"
    },
    {
        "front": "How is the system landscape called when SAP BTP is only providing the SAP FLP, no business data",
        "back": "Internal Access Point"
    },
    {
        "front": "What combines tile and target mapping the SAP LP service",
        "back": "app"
    },
    {
        "front": "Which system part provides the OData services for analytical apps",
        "back": "SAP HANA extended application services(xs)"
    },
    {
        "front": "What is the data source defintion for the SAP Fiori search?",
        "back": "search connectors"
    },
    {
        "front": "What is needed to define a target mapping for a Web Dynpro ABAP application?",
        "back": "System alias, Web Dynpro application, Web Dynpro configuration"
    },
    {
        "front": "What is needed to define a target mapping for an ABAP Transaction?",
        "back": "Transaction Code, System alias"
    },
    {
        "front": "Which tool is used in an SAP Business Suite environment to model KPI",
        "back": "KPI Modeler"
    },
    {
        "front": "Which part of a KPI is responsible for the visualization?",
        "back": "Drill-down"
    },
    {
        "front": "What is used as a container for SAP Fiori in an Enterprise Portal",
        "back": "SAP Fiori iView"
    },
    {
        "front": "What is the central app to display Workflow items in SAP Fiori?",
        "back": "My Inbox"
    },
    {
        "front": "In which systems is the SAP Gatweay workflow service implemented?",
        "back": "Front-End Server (FES)"
    },
    {
        "front": "What is SAP Screen Personas?",
        "back": "A web-based layer for adaptation of SAP GUI Dynpro and Web Dynpro ABAP"
    },
    {
        "front": "What created with SAP Screen Personas to change the structure of classical screens?",
        "back": "Flavors"
    },
    {
        "front": "SAP HANA extended application services (XS), which offers _____ based on data views in SAP HANA. ",
        "back": ".xsodata-files"
    },
    {
        "front": "SAP HANA XS provides the _______ that you can use to build and test development artifacts in the SAP HANA environment. ",
        "back": "SAP HANA Web-based Development Workbench"
    },
    {
        "front": "tools provided and URL of SAP HANA Web-based Development Workbench",
        "back": "Catalog, Editor, Security, Traces, http://<HANAsystem>:<port>/sap/hana/ide"
    },
    {
        "front": "To navigate to the generic drill-down app in SAP Business Suite, the user needs the target mapping with semantic object _____ and action ______ .",
        "back": "* and action analyzeSBKPIDetails"
    },
    {
        "front": "To navigate to the generic drill-down app in SAP S/4HANA 1511, the user needs the target mapping with semantic object ___ and action ____",
        "back": "* and action analyzeSBKPIDetailsS4HANA"
    },
    {
        "front": "To navigate to the generic drill-down app since SAP S/4HANA 1610, the user needs the target mapping _______ generated when creating a tile for the KPI. It is saved in the same catalog as the tile",
        "back": "automatically"
    },
    {
        "front": "The tiles had different names in the first version of the KPI Modeler. Numeric was called Point Value, Comparison was called Deviation, and Actual vs. Target was called Contribution. Only Trend did not change.",
        "back": "true"
    },
    {
        "front": " you can configure the appearance and functions of the FLP header bar by with the _____ URL option.",
        "back": "sap-ushell-config"
    },
    {
        "front": "my inbox: Map decision to outcom container value",
        "back": "/IWWRK/ES_WF_WI_BEFORE_UPD_IB"
    },
    {
        "front": "my inbox: Change subject in query result",
        "back": "/IWPGW/ES_TGW_TASK_QUERY"
    },
    {
        "front": "my inbox: Modify task title and task description",
        "back": "/IWPGW/ES_TGW_TASK_DATA"
    },
    {
        "front": "my inbox: modify user details",
        "back": "/IWPGW/ES_TGW_USER_DETAIL"
    },
    {
        "front": "All SAPUI5 resources are available on the content delivery network _____. There, you can also find multiple SAPUI5 versions, and you can reference them in your application.",
        "back": "Akamai"
    },
    {
        "front": "_____ is the only IDE not supporting SAPUI5.",
        "back": "SAP Web IDE for SAP HANA"
    },
    {
        "front": "The Cloud Connector must not be used with products other than SAP Business Technology Platform or SAP S/4HANA Cloud. (t/f)",
        "back": "true"
    },
    {
        "front": "ABAP connection destinations",
        "back": "HTTP, Mail, RFC, LDAP"
    },
    {
        "front": "Location IDs provides advanced connection option where",
        "back": "multiple cloud connectors for one subaccount"
    },
    {
        "front": "Connection ABAP to consume OData from SAP BAS, property ______ and usage options with this destination:",
        "back": "WebIDEUsage, odata_abap, dev_abap"
    },
    {
        "front": "WebIDEUsage option: For OData functionality of SAP Gateway, corresponding to URL path: /sap/opu/odata",
        "back": "odata_abap"
    },
    {
        "front": "WebIDEUsage option: For extensibility scenarios and developing or deploying to an SAPUI5 ABAP repository, corresponds to url path:/sap/bc/adt",
        "back": "dev_abap"
    },
    {
        "front": "Cloud Connector: Destination configuration wait time",
        "back": "HTML5.Timeout"
    },
    {
        "front": "Cloud connector, remote system resides behind firewall, proxy type",
        "back": "OnPremise"
    },
    {
        "front": "Cloud Connector: HTML5 Applications runtime allows this destination to be used dynamically on the host or path level",
        "back": "HTML5.DynamicDestination: true"
    },
    {
        "front": "Cloud connector: Expose the destination to the SAP BAS",
        "back": "WebIDEEnabled: true"
    },
    {
        "front": "Start portable variant of cloud connector",
        "back": "go.bat"
    },
    {
        "front": "Monitor cloud connector",
        "back": "In Connectivity section of SAP BTP Cockpit"
    },
    {
        "front": "Cloud connectors uses ____ for access control",
        "back": "strict white-list"
    },
    {
        "front": "deployment configuration file for sapui5 application and can be generated with",
        "back": "ui5-deploy.yaml, npx fiori add deploy-config"
    },
    {
        "front": "Which of the following parameters must you provide when you create an initial cloud connector configuration?",
        "options": {"A": "Region","B": "Display Name","C": "Subaccount","D": "Password","E": "Location ID", "F": "Description"},
        "back": ["A","C","D"]
    },
    {
        "front": "Standard bootstrap file for sapui5",
        "back": "sap-ui-core.js"   
    },
    {
        "front": "benefits loading SAPUI5 from CDN",
        "back": "Loading SAPUI5 from a CDN improves your app performance; you can load from a server that (in most cases) is much closer to your location, and you can benefit from the caching mechanism and the language fallback logic."
    },
    {
        "front": "boot strap sapui5 <script> tag",
        "back": "<script id=\"sap-ui-bootstrap\" src=\"resources/sap-ui-core.js\" data-sap-ui-libs=\"sap.m\" data-sap-ui-theme=\"sap_fiori_3\" data-sap-ui-resourceroots='{\"student00.sap.training.helloworld\": \"./\"}'></script>" 
    },
    {
        "front": "script attribute prefix sapui5",
        "back": "data-sap-ui-"
    },
    {
        "front": "single attribute for config information(script, sapui5) instead of attaching individual options",
        "back": "data-sap-ui-config"
    },
    {
        "front": "global configuration object/attribute name sapui5 scripttag",
        "back": "sap-ui-config"
    },
    {
        "front": "can you add configuration parameters to url for sap",
        "back": "yes, ex index.html?sap-ui-debug=true"
    },
    {
        "front": "accessing runtime configuration object with method(sapui5/js)",
        "back": "sap.ui.getCore().getConfiguration()"
    },
    {
        "front": "You can display controls in HTML element called UI area by invoking the ____ method(ther can be ____ UI area(s)",
        "back": "placeAt(), multiple"
    },
    {
        "front": "Designed to support real Asynchronous Module Definitions(AMDs)",
        "back": "sap.ui.define(), sap.ui.require()"
    },
    {
        "front": "Synchronous loading of modules was possible using _____, declaring a module was possible with _____, beginning with SAPUI5 ver ___ both of these functions are depracated",
        "back": "jQuery.sap.require(),jQuery.sap.declare,1.52"
    },
    {
        "front": "Can use relative path of dependency in sap.ui.define with ./ ?",
        "back": "yes/true"
    },
    {
        "front": "A library preload file _____ contains all modules of a certain library. These modules will only be executed ____",
        "back": "library-preload.js, ondemand if the application requires them"
    },
    {
        "front": "An application must not reference the library-preload.js, if preload files exist, sapui5 automatically loads them",
        "back": "true"
    },
    {
        "front": "preload configuration parameters",
        "back": "async,sync, auto"
    },
    {
        "front": "set to true to enable async loading",
        "back": "data-sap-ui-async"
    },
    {
        "front": "the ____ method of the core registers a given function that is executed after the framework has been initialized.",
        "back": "sap.ui.getCore().attachInit()"
    },
    {
        "front": "using configuration option _____, it is possible to redirect the request for the application specific modules to the corresponding web application.",
        "back": "sap-data-ui-resourceRoots"
    },
    {
        "front": "asynchronous view instantiation factory method",
        "back": "sap.ui.core.mvc.<Type>View.create(mOptions):Promise, and generic factory sap.ui.core.mvc.View.create(mOptions):Promise"
    },
    {
        "front": "When a promise is pending, it can transition to the ____ or ___ state, once it is ____ or ____ it will never transition to any other state, and its value or failure reason will not change.",
        "back": "fullfilled, rejected"
    },
    {
        "front": "3 states of a promise",
        "back": "Pending, Fulfilled, Rejected"
    },
    {
        "front": "primary way of interacting with a promise is through its ____ method, which registers callbacks to recieve either a promises eventual value or reason why the promise cant be fullfilled.",
        "back": "then()"
    },
    {
        "front": "Two arguments for then",
        "back": "callback for success and callback for failure"
    },
    {
        "front": "configuration object properties, view instantiation",
        "back": "id,viewName, type"
    },
    {
        "front": "Controller defined by extending _____ object of the SAPUI5 core.",
        "back": "Controller e.g Controller.extend()"
    },
    {
        "front": "lifecycle hooks controller",
        "back": "onInit()(first render), onExit(), onAfterRendering(), onBeforeRendering()"
    },
    {
        "front": "Two default methods for the implementation of a JavaScript view",
        "back": "getControllerName, createContent"
    },
    {
        "front": "When reusing Javascript views there is gaurenteed ____ you _____ use hardcoded IDs",
        "back": "uniqueness, hardcoded"
    },
    {
        "front": "XML View options",
        "back": "xmlns:namespace, xmlns, controllerName"
    },
    {
        "front": "HTML view: All view-specific properties can be added to the <template> tag as ____ attributes",
        "back": "data-*"
    },
    {
        "front": "JSON: you add child controls as ____, everything child of ____",
        "back": "arrays, content aggregation"
    },
    {
        "front": "embedding views in XML view",
        "back": "<mvc:(JSView|XMLView|HTMLView|JSONView) id=\"idView\" viewName\"sap.training.view.MyView\"/> "
    },
    {
        "front": "Which function is provided to register a URL prefix for a module name prefix?",
        "back": "JQuery.sap.registerModulePath()"
    },
    {
        "front": "Layout: used to bring multi controls into one column, each control is placed below the other",
        "back": "sap.ui.layout.VerticleLayout"
    },
    {
        "front": "Layout: spacing between controls not adjustable(can be added with css), way to place controls side-by-side, forces all controls to be on one line without wrapping by default",
        "back": "sap.ui.layout.HorizontalLayout"
    },
    {
        "front": "Layout: flexible layouts, linebreaks, large, medium and small sized screens, responsive table free layouts, variable column amount of children based on screensize",
        "back": "sap.ui.layout.Grid"
    },
    {
        "front": "grid layout option: screens greater than 600 px and smaller than 1024 px",
        "back": "Tablet(\"medium\")"
    },
    {
        "front": "grid layout option: screens smaller than 600 px",
        "back": "Phone(\"small\")"
    },
    {
        "front": "grid layout option: For screens greater than or equal to 1024 px and smaller than 1440px",
        "back": "Desktop(\"large\")"
    },
    {
        "front": "grid layout option: for screens greater than or equal to 1440 px",
        "back": "LargeDesktop(\"extra large\")"
    },
    {
        "front": "device/grid layout size information API Reference",
        "back": "sap.ui.Device.media.RANGESETS"
    },
    {
        "front": "order grid layout values must be provided in",
        "back": "extra large, large, medium, small"
    },
    {
        "front": "gridlayout specifier format",
        "back": "<layoutData><l:GridData indent=\"M4\" span=\"L2 M8 S12\"/></layoutData>"
    },
    {
        "front": "the ____Layout expands the added content to fit a whole line, if window is resized controls are moved between the lines and resized again",
        "back": "ResponsiveFlow"
    },
    {
        "front": "The width of all ResponsiveFlowLayout elements should be set to ___%",
        "back": "100"
    },
    {
        "front": "Each ResponsiveFlowLayout element has a weight relative to other elements within a row, if one element has the weight 2 and all others have 1, the element is ___ the size of others.",
        "back": "double"
    },
    {
        "front": "Should Form layout be used for mobile user interfaces?",
        "back": "yes"
    },
    {
        "front": "To explicitly switch between Edit Mode and Navigation Mode from within a field in Form Layout press __",
        "back": "F2"
    },
    {
        "front": "A Form aggregates _____ to separate form content into different blocks",
        "back": "FormContainer"
    },
    {
        "front": "A FormContainer aggregates ______ A _____ combines form fields with a label.",
        "back": "FormElement(s)"
    },
    {
        "front": "If hCells is set to ____, the size is determined by the number of fields and the available cells. For Labels, the automatic size is 3 cells.",
        "back": "auto"
    },
    {
        "front": "Setting the additional property ____ to true for a column also reacts to the minScreenWidth you specify. In such a case, the column shows as a pop-in on smaller screens, instead of being completely hidden.",
        "back": "demandPopin"
    },
    {
        "front": "If an SAPUI5 application is running on a mobile device, a platform attribute is added to the HTML tag, which provides information about the current platform and version. In addition, the SAPUI5 adds a platform-dependent CSS class to the HTML tag of the page. ex",
        "back": "<html data-sap-ui-os=\"iOS9.1\" [...] class=\"sap-ios [...]\">... <html data-sap-ui-os=\"Android6.0\" [...] class=\"sap-android [...]\">"
    },
    {
        "front": "The default design for all controls belonging to the sap.m library is the ____",
        "back": "Cozy Density"
    },
    {
        "front": "if your application combines controls belonging to different libraries, we strongly recommend that you set the CSS class ____ if you want to use Cozy Density ",
        "back": "sapUiSizeCozy"
    },
    {
        "front": "the SAP Fiori launchpad (FLP) optionally reads the supported Content Densities from ________ and, if available, sets the appropriate Content Density class on the body tag.",
        "back": "the app descriptor (manifest.json)"
    },
    {
        "front": "Client side model(s)",
        "back": "JSON,XML,Resource"
    },
    {
        "front": "Server side model(s)",
        "back": "OData"
    },
    {
        "front": "Adding data to json model",
        "back": "setData(), loadData()"
    },
    {
        "front": "The resource model only supports ___ binding mode because it deals with static text only",
        "back": "one-time"
    },
    {
        "front": "Default binding mode for JSON Model",
        "back": "two-way"
    },
    {
        "front": "Default binding mode for XML Model",
        "back": "two-way"
    },
    {
        "front": "Default binding mode for OData Model",
        "back": "one-way"
    },
    {
        "front": "to set the default binding mode use method",
        "back": "setDefaultBindingMode()"
    },
    {
        "front": "allows properties of the control to get automatically initialized and updated from model data",
        "back": "Property binding"
    },
    {
        "front": "Can be used to automatically create child controls according to model data",
        "back": "Aggregation Binding"
    },
    {
        "front": "Allows to bind UI elements to a specific object in the model data, which will create a binding context and allows relative binding within the control and all of its children, This is especially helpful in master/detail scenarios",
        "back": "Element Binding"
    },
    {
        "front": "Binding that requires defintion of a template, which is cloned for each bound entry of the model.",
        "back": "Aggregation binding"
    },
    {
        "front": "Simple types available for data binding in SAPUI5",
        "back": "Integer, Float, String, Boolean, Date, Time, DateTime, Currency, FileSize"
    },
    {
        "front": "Function Simple Type: Called when the user modifies a value in the UI and the change is transported back into the model, May throw ParseException in the case where the value cannot be converted",
        "back": "parseValue()"
    },
    {
        "front": "Called in the case of successfull parsing to check additional constraints, like minimum or maximum value, May throw ValidateException in the case where constraints are violated.",
        "back": "validateValue()"
    },
    {
        "front": "Called when the value in the model is changed to convert it to the type of the control property to which it is bound, may throw a format exception.",
        "back": "formatValue()"
    },
    {
        "front": "String validation constraints",
        "back": "string, integer/float, boolean, maxLength, minLength, startsWith, startsWithIgnoreCase, endsWith, endsWithIgnoreCase, contains, equals, search"
    },
    {
        "front": "Data type does not have any format options",
        "back": "string"
    },
    {
        "front": "The use of styles _____ instead of pattern for Date type is preferred, as it automatically uses a locale-dependent date pattern.",
        "back": "short, medium, long or full"
    },
    {
        "front": "Format options supported by Date type",
        "back": "pattern, UTC, style"
    },
    {
        "front": "Validation constraints supported by Date",
        "back": "maximum, minimum"
    },
    {
        "front": "layout custom type implementation",
        "back": "extend/inherit simpletype, implement methods formatValue(), parseValue(), validateValue()"
    },
    {
        "front": "Available capabilities handling incorrect user input",
        "back": "attachFormatError(), attachParseError(), attachValidationError(), attachValidationSuccess()"
    },
    {
        "front": "method used to visualize the state related to the input fields value, possible value states are Warning, Error, Success, None",
        "back": "setValueState()"
    },
    {
        "front": "SAPUI5 provided central management for messages, available globally by calling singleton",
        "back": "Message Manager, sap.ui.getCore().getMessageManager()"
    },
    {
        "front": "You can activate automatic message generation in componenet metadata or as a parameter when instantiating an component, ___ section of manifest.json file and for individual controls by registering controls in the Message Manager using the method _____",
        "back": "sap.ui5, sap.ui.getCore().getMessageManager().registerObject()"
    },
    {
        "front": "registers a managed object so that its parse and validation errors are handled by the Message Manager",
        "back": "registerObject()"
    },
    {
        "front": "filter operators available",
        "back": "BT,Contains, EndsWith, EQ, GE, GT, LE, LT, NE, StartsWith"
    },
    {
        "front": "Enable binding of multiple properties in different models to a single property of a control, work only from mode to view(read only)",
        "back": "Calculated fields"
    },
    {
        "front": "Resource Bundle files: Language suffixes are formed according the ____ locale syntax",
        "back": "JDK"
    },
    {
        "front": "Resource bundle file name format, UK english",
        "back": "i18n_en_UK.properties"
    },
    {
        "front": "A collection fo resource bundle files, all files are named with the same base name and an optional suffix that identifies the language contained in each file",
        "back": "Resource Bundle"
    },
    {
        "front": "IE returns the language of the OS installation as ____ and the language from the OS regional settings as ___",
        "back": "browserLanguage, userLanguage"
    },
    {
        "front": "by priority(last highest) source of Current Language Code/Locale in SAPUI5",
        "back": "Hard-coded UI5 default locale, Configured browser language, Configured user language, general language information, language contained in UA string, language configured in application, URL params"
    },
    {
        "front": "Hard-coded UI5 default locale",
        "back": "en"
    },
    {
        "front": "Configured browser language for IE OS language",
        "back": "window.navigator.browserLanguage"
    },
    {
        "front": "Configured user language, for IE the language in region settings",
        "back": "window.navigator.userLanguage"
    },
    {
        "front": "general language information from the browser",
        "back": "window.navigatot.language"
    },
    {
        "front": "Android languaged contained in UA string",
        "back": "window.navigator.userAgent"
    },
    {
        "front": "Configured locale in application coding",
        "back": "sap.ui.core.Configuration"
    },
    {
        "front": "setting language by URL parameters",
        "back": "sap-ui-language"
    },
    {
        "front": "If you need localized texts within your application you can use the JS module _____ to load the locale specific file from the server and access the texts within it",
        "back": "sap/base/i18n/ResourceBundle"
    },
    {
        "front": "to create an instance of sap/base/i18n/Resource bundle call ____, if no locale is passed the default locale is en, otherwise the locale is taken from the sapui5 configuration",
        "back": "ResourceBundle.create()"
    },
    {
        "front": "ResourceBundle: the create() method returns a new resource bundle or a ___ on that bundle in asynchronous cases",
        "back": "Promise"
    },
    {
        "front": "From SAPUI5 1.77 a list of supported locales can be specified to restrict number of locales for which resource bundles may be requested, this list is passed using parameter _____ if it is empty or not specified all locales are supported",
        "back": "supportedLocales"
    },
    {
        "front": "English used to be the default locale, but now any fallback locale can be specified using parameter _____, if not specified fallback defaults to en",
        "back": "fallbackLocale"
    },
    {
        "front": "Relationships between resources are hyperlinks between resources in the OData protocol",
        "back": "Hypermedia design pattern"
    },
    {
        "front": "OData: The resources are defined in an abstract data model that is based on the ____",
        "back": "Entity Data Model"
    },
    {
        "front": "There are twp types of documents associated with each OData service: ____ and ____",
        "back": "The Service Document, Service Metadata Document"
    },
    {
        "front": "Document that describes the data model, the structure, organization of all the resources exposed as HTTP endpoints by the service, and Provides a full description of the services interface",
        "back": "Service Metadata Document"
    },
    {
        "front": "Document declares the resources accessible from the Service Root URI",
        "back": "Service Document"
    },
    {
        "front": "Service metadata document can be retrieved by appending string ____ to the service root uri",
        "back": "$metadata"
    },
    {
        "front": "_____ Describes the EDM for a given service using an XML language for describing models called _____",
        "back": "Service Metadata Document, Conceptual Schema Definition Language(CSDL)"
    },
    {
        "front": "Richly structured records with a key, structure provided by its properties",
        "back": "Entity Types"
    },
    {
        "front": "____ are instances of entity types and are grouped in entity sets",
        "back": "Entities"
    },
    {
        "front": "Structured types also consisting of a list of properties but no key, used to type the properties of entity types",
        "back": "Complex Types"
    },
    {
        "front": "Special properties on entity types that are bound to a specific association",
        "back": "Navigation properties"
    },
    {
        "front": "define the relationships between two or more Entity Types",
        "back": "Associations"
    },
    {
        "front": "OData services can expose ____ which are simple functions whose semantics are defined by the author of the function, can accept input and return entities or complex/primitive values",
        "back": "Service Operations"
    },
    {
        "front": "Create: ___, Read: ____, Update: ____, Delete: ____",
        "back": "POST,GET,PUT,DELETE"
    },
    {
        "front": "OData uses HTTP ____ for optimistic concurrency control. ___ can also be used for conditional GET request",
        "back": "ETags"
    },
    {
        "front": "Query string parameters a client may specify to control the amount and oder of the data that an OData service returns for the resource identified by the URI",
        "back": "System Query Options"
    },
    {
        "front": "List of important System Query options",
        "back": "Filtering: $filter, Projecting: $select, Sorting: $orderby, Paging: $top and $skip, Inlining: $expand"
    },
    {
        "front": "When processing a PUT request the server returns _____ to indicate success, there is no response body",
        "back": "HTTP status code 204(No Content)"
    },
    {
        "front": "If a delete opeation executed successfully the server returns ___ with no response body",
        "back": "HTTP Status Code 204 (No Content)"
    },
    {
        "front": "______ is a server-side model, meaning the dataset is only available on the server and the client only knows the currently visible(requested) data. Operations such as sorting and filtering are done on the server.",
        "back": "OData model"
    },
    {
        "front": "app changes when setup to use odata service",
        "back": "manifest.json updated property dataSources is added to the sap.app section including the URI to the selected OData service, OData model entry is added to models section, ui5.yaml and ui5-local.yaml proxy settings are added, a file named metadata.xml reflecting metadata service entities is added to localService folder"
    },
    {
        "front": "___ OData model instance can cover ____ OData service, To access Multiple services you have ____ model instances",
        "back": "one, one, to create multiple OData"
    },
    {
        "front": "OData Model Instance: Service URL can be passed as first parameter or within ___ map to the constructor",
        "back": "mParameters"
    },
    {
        "front": "The only mandatory parameter(s) when creating an ODataModel Instance is/are ____",
        "back": "the service URL"
    },
    {
        "front": "____ parameter allows the application to read associated entities with their navigation properties",
        "back": "expand"
    },
    {
        "front": "_____ parameter allows the application to define a subset of properties that is read when requesting an entity",
        "back": "select"
    },
    {
        "front": "OData: to create entities for a specified entity set call the ____ method, returns a context object that points to the newly created entity",
        "back": "createEntry()"
    },
    {
        "front": "To store entities in the OData backend the application calls _____, to reset the changes the application can calle ______ method ",
        "back": "submitChanges(), deleteCreatedEntry(oContext)"
    },
    {
        "front": "OData HTTP ETags: The ETag can be passed within the parameters map for ____ CRUD request, if no ETag is passed the ETag of the _____ is used, if it is loaded already",
        "back": "every, cached entity"
    },
    {
        "front": "If XRSF token is no longer valid for an OData model the function _____ can be called, the token is fetched with request to the service document, eo ensure the reception of a valid toke ensure that the service document is not cached.",
        "back": "refreshSecurityToken()"
    },
    {
        "front": "All Odata operations have a mandatory _____ parameter as well as optional _____ map",
        "back": "sPath, mParameters"
    },
    {
        "front": "the create() function triggeres a ____ request to an OData service",
        "back": "POST"
    },
    {
        "front": "the read() function triggers a ___ request to a specified path(OData service)",
        "back": "GET"
    },
    {
        "front": "The update() function triggers a _____ request to the OData service, the update method used is defined by the global ______ parameter, which is ___ by default",
        "back": "PUT/MERGE, defaultUpdateMethod, sap.ui.model.odata.UpdateMethod.Merge"
    },
    {
        "front": "To send update request in a PUT request you must set the parameter defaultUpdateMethod to ____ when instantiating the OData model.",
        "back": "sap.ui.model.odata.UpdateMethod.Put"
    },
    {
        "front": "The remove() function triggeres a _____ request to the OData service",
        "back": "DELETE"
    },
    {
        "front": "OData Model: If you carry out a ___,____ or ____ function the model identifies the bindings and triggers a refresh for these bindings.",
        "back": "create, update, delete"
    },
    {
        "front": "OData model: You can disable auto refresh by calling _____",
        "back": "oModel.setRefreshAfterChange(false);"
    },
    {
        "front": "the ____ function refreshes all data within an OData Model. Data that has been imported using manual CRUD request is ____ automatically",
        "back": "refresh(), not reloaded"
    },
    {
        "front": "_____ class is the base class for UI and faceless components.",
        "back": "sap.ui.core.Component"
    },
    {
        "front": "Mandatory component files",
        "back": "Component.js, manifest.json"
    },
    {
        "front": "To render UI Components you must wrap them in a _____",
        "back": "ComponentContainer"
    },
    {
        "front": "data attribute for  components within DOM",
        "back": "data-sap-ui-component"
    },
    {
        "front": "App descriptor: The ___ namespace contributes application specific attributes",
        "back": "sap.app"
    },
    {
        "front": "App descriptor: the ___ namespace contributes UI-specific attributes",
        "back": "sap.ui"
    },
    {
        "front": "App descriptor: the ___ name space contributes SAPUI5-specific attributes",
        "back": "sap.ui5"
    },
    {
        "front": "App descriptor: in the resources section of the ____ namespace, additional js and css resources for the component can be loaded.",
        "back": "sap.ui5"
    },
    {
        "front": "____ prevents verticle scrollbars appearing with Views that are set to 100% height",
        "back": "displayBlock=\"true\""
    },
    {
        "front": "To configure the router, add a ___ section to the ____ section in manifest.json",
        "back": "routing, sap.ui5"
    },
    {
        "front": "Default binding mode for OData v4 Model",
        "back": "Two-Way"
    },
    {
        "front": "Supported binding types OData v4",
        "back": "List, Context, Property"
    },
    {
        "front": "Supported events OData v4 Model",
        "back": "dataRequested, dataRecieved, patchSent, patchComplete"
    },
    {
        "front": "Available methods OData Model v4 context objects",
        "back": "getBinding, getIndex"
    },
    {
        "front": "to use service side filtering and server side sorting set the operation mode to ",
        "back": "sap.ui.model.odata.OperationMode.Server"
    },
    {
        "front": "list binding combines dynamic filter and static filter with logical ___",
        "back": "AND"
    },
    {
        "front": "Difference between function and actions for an OData service",
        "back": "functions must return data, and cant have a side effect, actions may return data and do have a side effect"
    },
    {
        "front": "OData: Request associated with Group ID ____ or _____ are bundled in one batch request which is triggered automatically before rendering",
        "back": "$auto, $auto.*"
    },
    {
        "front": "OData: Request associated with Group ID ____ are sent directly without batch",
        "back": "$direct"
    }
]
